$(function () {
  /*=================================================
  スクロール時のイベント
  ===================================================*/
  $(window).scroll(function () {
    // スクロール位置を取得
    let scroll = $(window).scrollTop();

    /*=================================================
    メインビジュアルの拡大・縮小
    ===================================================*/
    mv_scale(scroll);

  });

});

/*=================================================
メインビジュアルの拡大・縮小（共通処理）
===================================================*/
function mv_scale(scroll) {
  // window.innerWidthで画面幅を取得
  // PC表示の場合の処理（画面幅が900pxより大きい場合　※900pxはCSSのブレークポイントとあわせる）
  if (window.innerWidth > 900) {
    // メインビジュアルのCSS（width）を変更する
    // widthの値をスクロール量にあわせて増やすことで画像を拡大させる
    $("#mainvisual img").css({
      width: 100 / 3 + scroll / 10 + "%",
    });
    // スマホ表示の場合の処理（画面幅が900px以下の場合）
  } else {
    // メインビジュアルのCSS（width）を変更する
    // widthの値をスクロール量にあわせて減らすことで画像を縮小させる
    $("#mainvisual img").css({
      width: 100 - scroll / 10 + "%",
    });
  }
}

  
  new WOW().init();

  $(function(){
    /*=================================================
    スクロール時のイベント
    ===================================================*/
    /*=================================================
    Accessの背景画像を表示
    ===================================================*/
    $(window).scroll(function() {
      // スクロール位置を取得
      let scroll = $(window).scrollTop();

      // 画面下から#galleryまでの距離を取得
      let gallery_position = $('#gallery').offset().top - $(window).height();
      // 画面下から#accessまでの距離を取得
      let access_position = $('#access').offset().top - $(window).height();

      // 画面下から#contactまでの距離を取得
      let contact_position = $('#contact').offset().top - $(window).height();
  
      // #accessが表示された場合
      if(scroll > access_position){
        // #contactが表示されるまでの間は、背景画像をfadeInで表示する
        if(scroll < contact_position){
          $('.bg').fadeIn(500);
        } else {
          $('.bg').fadeOut(500);
        }
      // #accessが表示される前の場合
      } else {
        // 背景画像を表示しない
        $('.bg').fadeOut(500);
      }
    });
  
    /*=================================================
    画面読み込み時と画面幅変更時のイベント
    ===================================================*/
    $(window).on('load resize', function() {
      // スクロール位置を取得
      let scroll = $(window).scrollTop();
  
      /*=================================================
      メインビジュアルの拡大・縮小
      ===================================================*/
      mv_scale(scroll);
    });
  });
  